SiliconLabs/wfx-fullMAC-tools/Examples/STM32/commissioning/F429ZI_freertos/Src/lwip_freertos.c
/**************************************************************************//**
 * Copyright 2021, Silicon Laboratories Inc.
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *****************************************************************************/

#include "cmsis_os.h"
#include "stm32f4xx_hal.h"
#include "string.h" 
#include "ethernetif.h"
#include "lwip/netif.h"
#include "lwip/tcpip.h"
#include "lwip/apps/httpd.h"
#include "lwip/netifapi.h"
#include "sl_wfx.h"
#include "sl_wfx_host.h"
#include "sl_wfx_host_pin.h"
#include "sl_wfx_sae.h"
#include "dhcp_server.h"
#include "dhcp_client.h"
#include "demo_config.h"
#include "wifi_cli.h"

extern scan_result_list_t scan_list[];
extern uint8_t scan_count_web;

/* station and softAP network interface structures */
struct netif sta_netif, ap_netif;
char string_list[4096];
char event_log[50];
uint8_t ap_channel;
struct eth_addr ap_mac;
  
int use_dhcp_client = USE_DHCP_CLIENT_DEFAULT;

/* Station IP address */
uint8_t sta_ip_addr0 = STA_IP_ADDR0_DEFAULT;
uint8_t sta_ip_addr1 = STA_IP_ADDR1_DEFAULT;
uint8_t sta_ip_addr2 = STA_IP_ADDR2_DEFAULT;
uint8_t sta_ip_addr3 = STA_IP_ADDR3_DEFAULT;
uint8_t sta_netmask_addr0 = STA_NETMASK_ADDR0_DEFAULT;
uint8_t sta_netmask_addr1 = STA_NETMASK_ADDR1_DEFAULT;
uint8_t sta_netmask_addr2 = STA_NETMASK_ADDR2_DEFAULT;
uint8_t sta_netmask_addr3 = STA_NETMASK_ADDR3_DEFAULT;
uint8_t sta_gw_addr0 = STA_GW_ADDR0_DEFAULT;
uint8_t sta_gw_addr1 = STA_GW_ADDR1_DEFAULT;
uint8_t sta_gw_addr2 = STA_GW_ADDR2_DEFAULT;
uint8_t sta_gw_addr3 = STA_GW_ADDR3_DEFAULT;

/* SoftAP IP address */
uint8_t ap_ip_addr0 = AP_IP_ADDR0_DEFAULT;
uint8_t ap_ip_addr1 = AP_IP_ADDR1_DEFAULT;
uint8_t ap_ip_addr2 = AP_IP_ADDR2_DEFAULT;
uint8_t ap_ip_addr3 = AP_IP_ADDR3_DEFAULT;
uint8_t ap_netmask_addr0 = AP_NETMASK_ADDR0_DEFAULT;
uint8_t ap_netmask_addr1 = AP_NETMASK_ADDR1_DEFAULT;
uint8_t ap_netmask_addr2 = AP_NETMASK_ADDR2_DEFAULT;
uint8_t ap_netmask_addr3 = AP_NETMASK_ADDR3_DEFAULT;
uint8_t ap_gw_addr0 = AP_GW_ADDR0_DEFAULT;
uint8_t ap_gw_addr1 = AP_GW_ADDR1_DEFAULT;
uint8_t ap_gw_addr2 = AP_GW_ADDR2_DEFAULT;
uint8_t ap_gw_addr3 = AP_GW_ADDR3_DEFAULT;

static void lwip_start_task_entry(void const * argument);
static int netif_config(void);

#ifdef LWIP_HTTP_SERVER
static char from_hex(char ch);
static sl_status_t url_decode(char *str);
/* prototype CGI handler */
static const char *toggle_led_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
static const char *start_station_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
static const char *stop_station_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
static const char *start_softap_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
static const char *stop_softap_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
static const char *disconnect_client_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
static const char *start_scan_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
static const char *get_led_states_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
static const char *get_interface_states_cgi_handler(int index, int num_params, char *pc_param[], char *pc_value[]);
/* List CGI scripts and corresponding handler */
static const tCGI toggle_led_cgi={"/toggle_led.cgi", toggle_led_cgi_handler};
static const tCGI start_station_cgi={"/start_station.cgi", start_station_cgi_handler};
static const tCGI stop_station_cgi={"/stop_station.cgi", stop_station_cgi_handler};
static const tCGI start_softap_cgi={"/start_softap.cgi", start_softap_cgi_handler};
static const tCGI stop_softap_cgi={"/stop_softap.cgi", stop_softap_cgi_handler};
static const tCGI disconnect_client_cgi={"/disconnect_client.cgi", disconnect_client_cgi_handler};
static const tCGI start_scan_cgi={"/start_scan.cgi", start_scan_cgi_handler};
static const tCGI get_led_states_cgi={"/get_led_states.cgi", get_led_states_cgi_handler};
static const tCGI get_interface_states_cgi={"/get_interface_states.cgi", get_interface_states_cgi_handler};
/* SSI handler */
static uint16_t ssi_handler(int index, char *pc_insert, int insert_len);

/* table of the CGI names and handlers */
static tCGI cgi_table[9];

/* Server-Side Include (SSI) tags */
static char const *ssi_tags[] = {
  "led0_state",
  "led1_state",
  "scan_list",
  "softap_state",
  "softap_ssid",
  "softap_ip",
  "softap_mac",
  "softap_secu",
  "softap_channel",
  "clients_list",
  "station_state",
  "station_ip",
  "station_mac",
  "ap_ssid",
  "ap_mac",
  "ap_secu",
  "ap_channel",
  "event"
};

/***************************************************************************//**
 * @brief Initialize the web server CGI handlers and SSI handler
 ******************************************************************************/
static void cgi_ssi_init (void) {
  cgi_table[0] = toggle_led_cgi;
  cgi_table[1] = start_station_cgi;
  cgi_table[2] = stop_station_cgi;
  cgi_table[3] = start_softap_cgi;
  cgi_table[4] = stop_softap_cgi;
  cgi_table[5] = disconnect_client_cgi;
  cgi_table[6] = start_scan_cgi;
  cgi_table[7] = get_led_states_cgi;
  cgi_table[8] = get_interface_states_cgi;
  
  //give the CGI and SSI tables to the HTTP server
  http_set_cgi_handlers(cgi_table, 9);
  http_set_ssi_handler(ssi_handler, ssi_tags, 18);
}

/***************************************************************************//**
 * @brief Web server CGI handler for controlling the LEDs.
 ******************************************************************************/
static const char *toggle_led_cgi_handler (int index, int num_params,
                                           char *pc_param[], char *pc_value[]) {
  /* Check the cgi parameters */
  for (uint16_t i = 0; i < num_params; i++) {
    if (strcmp(pc_param[i], "led_id") == 0) {
      if (strcmp(pc_value[i], "0") == 0) {
        printf("LED 0 toggle\r\n");
        HAL_GPIO_TogglePin(LD3_GPIO_Port, LD3_Pin);
        HAL_GPIO_TogglePin(SL_WFX_LED0_PORT, SL_WFX_LED0_GPIO);
      } else if (strcmp(pc_value[i], "1") == 0) {
        printf("LED 1 toggle\r\n");
        HAL_GPIO_TogglePin(LD2_GPIO_Port, LD2_Pin);
        HAL_GPIO_TogglePin(SL_WFX_LED1_PORT, SL_WFX_LED1_GPIO);
      }
    }
  }
  
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start the station interface.
 ******************************************************************************/
static const char *start_station_cgi_handler (int index, int num_params,
                                              char *pc_param[], char *pc_value[]) {
  sl_status_t status = SL_STATUS_OK;
  int ssid_length = 0, passkey_length = 0;
  int ap_index = -1;

  if (num_params == 3) {
    if (strcmp(pc_param[0], "ssid") == 0) {
      url_decode(pc_value[0]);
      memset(wlan_ssid, 0, sizeof(wlan_ssid));
      strncpy(wlan_ssid, pc_value[0], sizeof(wlan_ssid)-1);
      ssid_length = strlen(wlan_ssid);
      // Retrieve the AP information from the scan list, presuming that the
      // first matching SSID is the one (not necessarily true).
      for (uint16_t i = 0; i < scan_count_web; i++) {
        if (strcmp((char *) scan_list[i].ssid_def.ssid, wlan_ssid) == 0) {
          ap_index = i;
          memcpy(&wlan_bssid, scan_list[i].mac, SL_WFX_BSSID_SIZE);
          break;
        }
      }
    }
    if (strcmp(pc_param[1], "pwd") == 0) {
      url_decode(pc_value[1]);
      memset(wlan_passkey, 0, sizeof(wlan_passkey));
      strncpy(wlan_passkey, pc_value[1], sizeof(wlan_passkey)-1);
      passkey_length = strlen(wlan_passkey);
    }
    if (strcmp(pc_param[2], "secu") == 0) {
      url_decode(pc_value[2]);
      if (strcmp(pc_value[2], "WPA3") == 0) {
        wlan_security = WFM_SECURITY_MODE_WPA3_SAE;
      }else if ((strcmp(pc_value[2], "WPA2") == 0) || (strcmp(pc_value[2], "WPA") == 0)) {
        wlan_security = WFM_SECURITY_MODE_WPA2_WPA1_PSK;
      }else if (strcmp(pc_value[2], "WEP") == 0) {
        wlan_security = WFM_SECURITY_MODE_WEP;
      }else if (strcmp(pc_value[2], "OPEN") == 0) {
        wlan_security = WFM_SECURITY_MODE_OPEN;
      }
    }
    if (!(wifi_context.state & SL_WFX_STA_INTERFACE_CONNECTED)) {
      if (wlan_security == WFM_SECURITY_MODE_WPA3_SAE) {
        status = sl_wfx_sae_prepare(&wifi_context.mac_addr_0,
                                    (sl_wfx_mac_address_t *)wlan_bssid,
                                    (uint8_t *)wlan_passkey,
                                    strlen(wlan_passkey));
        if (status != SL_STATUS_OK) {
          printf("SAE prepare failure\r\n");
          strcpy(event_log, "SAE prepare failure");
        }
      }

      if(status == SL_STATUS_OK) {
        status = sl_wfx_send_join_command((uint8_t*) wlan_ssid, ssid_length,
                                          NULL, 0, wlan_security, 0, 0,
                                          (uint8_t*) wlan_passkey, passkey_length,
                                          NULL, 0);
        if(status != SL_STATUS_OK) {
          printf("Connection command error\r\n");
          strcpy(event_log, "Connection command error");
        } else {
          // Update the local AP information with the scan information
          if (ap_index >= 0) {
            ap_channel = scan_list[ap_index].channel;
            memcpy(&ap_mac, scan_list[ap_index].mac, SL_WFX_BSSID_SIZE);
          }
        }
      }
    }
  } else {
    printf("Invalid Connection Request\r\n");
    strcpy(event_log, "Invalid Connection Request");
  }
  
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to stop the station interface.
 ******************************************************************************/
static const char *stop_station_cgi_handler (int index, int num_params,
                                             char *pc_param[], char *pc_value[]) {
  sl_wfx_send_disconnect_command();
  
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start the softAP interface.
 ******************************************************************************/
static const char *start_softap_cgi_handler (int index, int num_params,
                                             char *pc_param[], char *pc_value[]) {
  sl_wfx_start_ap_command(softap_channel, (uint8_t*) softap_ssid, 
                          strlen(softap_ssid), 0, 0, softap_security,
                          0, (uint8_t*) softap_passkey, strlen(softap_passkey),
                          NULL, 0, NULL, 0);
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start the softAP interface.
 ******************************************************************************/
static const char *stop_softap_cgi_handler (int index, int num_params,
                                            char *pc_param[], char *pc_value[]) {
  sl_wfx_stop_ap_command();
  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to disconnect a client from the softAP
 * interface.
 ******************************************************************************/
static const char *disconnect_client_cgi_handler (int index, int num_params,
                                                  char *pc_param[], char *pc_value[]) {
  sl_wfx_mac_address_t mac_address;
  const char separator[] = ":";
  char *mac_byte = NULL;

  for (uint16_t i = 0; i < num_params; i++) {
    if (strcmp(pc_param[i], "mac") == 0) {
      mac_byte = strtok(pc_value[i], separator);
      for (uint8_t j = 0; j < 6; j++) {
        mac_address.octet[j] = (uint8_t)strtoul(mac_byte, NULL, 16);
        mac_byte = strtok(NULL, separator);
      }
      sl_wfx_disconnect_ap_client_command(&mac_address);
    }
  }

  return "/empty.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to start a scan.
 ******************************************************************************/
static const char *start_scan_cgi_handler (int index, int num_params,
                                           char *pc_param[], char *pc_value[]) {
  sl_status_t result;
  
