SiliconLabs/wfx-fullMAC-tools/Examples/STM32/commissioning/F429ZI_freertos/Src/lwip_freertos.c
  /* Reset scan list */
  scan_count_web = 0;
  memset(scan_list, 0, sizeof(scan_result_list_t) * SL_WFX_MAX_SCAN_RESULTS);
  
  xSemaphoreTake(wifi_scan_sem, 0);
  /* perform a scan on every Wi-Fi channel in active mode */
  result = sl_wfx_send_scan_command(WFM_SCAN_MODE_ACTIVE, NULL,0, NULL,0,NULL,0,NULL);
  if ((result == SL_STATUS_OK) || (result == SL_STATUS_WIFI_WARNING)) {
    if (xSemaphoreTake(wifi_scan_sem, 5000/portTICK_PERIOD_MS) != pdTRUE) {
      printf("Scan command timeout\r\n");
    }
  }

  return "/scan_results.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to get the LED states.
 ******************************************************************************/
static const char *get_led_states_cgi_handler (int index,
                                               int num_params,
                                               char *pc_param[],
                                               char *pc_value[]) {
  return "/led_states.json";
}

/***************************************************************************//**
 * @brief Web server CGI handler to get the interface states.
 ******************************************************************************/
static const char *get_interface_states_cgi_handler (int index,
                                                     int num_params,
                                                     char *pc_param[],
                                                     char *pc_value[]) {
  return "/interface_states.json";
}

static uint16_t ssi_handler (int index, char *pc_insert, int insert_len) {
  int value, result;
  char string_field[100];
  char client_name[9] = {'C', 'l', 'i', 'e', 'n', 't', ' ', ' ', '\0'};
  uint8_t add_separator = 0;
  
  switch (index) {
  case 0: /* <!--#led0_state--> */
    value = HAL_GPIO_ReadPin(SL_WFX_LED0_PORT, SL_WFX_LED0_GPIO);
    result = snprintf(pc_insert, 2, "%d", value);
    break;
  case 1: /* <!--#led1_state--> */
    value = HAL_GPIO_ReadPin(SL_WFX_LED1_PORT, SL_WFX_LED1_GPIO);
    result = snprintf(pc_insert, 2, "%d", value);
    break;
  case 2: /* <!--#scan_list--> */
    for (int i = 0; i < scan_count_web; i++) {
      snprintf(string_field, 100, "{\"ssid\":\"%s\", \"rssi\":\"%d\", \"secu\":\"%s\"}",
               (strlen((char *) scan_list[i].ssid_def.ssid) != 0) ? scan_list[i].ssid_def.ssid : "Hidden",
               ((int16_t)(scan_list[i].rcpi - 220)/2),
               (scan_list[i].security_mode.wpa3)     ? "WPA3" : \
                ((scan_list[i].security_mode.wpa2)   ? "WPA2" : \
                 ((scan_list[i].security_mode.wpa)   ? "WPA"  : \
                   ((scan_list[i].security_mode.wep) ? "WEP" : "OPEN"))));
      strcat(string_list, string_field);
      if(i != (scan_count_web - 1)) strcat(string_list, ",");
    }
    result = snprintf(pc_insert, strlen(string_list) + 1, string_list);
    memset(string_list, 0, sizeof(string_list));
    break;
  case 3: /* <!--#softap_state--> */
    if (wifi_context.state & SL_WFX_AP_INTERFACE_UP) {
      result = snprintf(pc_insert, 2, "1");
    } else {
      result = snprintf(pc_insert, 2, "0");
    }
    break;
  case 4: /* <!--#softap_ssid--> */
    result = snprintf(pc_insert, 32, "%s", softap_ssid);
    break;
  case 5: /* <!--#softap_ip--> */
    result = sprintf(pc_insert, "%d.%d.%d.%d",
                     ap_netif.ip_addr.addr & 0xff,
                     (ap_netif.ip_addr.addr >> 8) & 0xff,
                     (ap_netif.ip_addr.addr >> 16) & 0xff,
                     (ap_netif.ip_addr.addr >> 24) & 0xff);
    break;
  case 6: /* <!--#softap_mac--> */
    result = sprintf(pc_insert, 
                     "%02X:%02X:%02X:%02X:%02X:%02X", 
                     wifi_context.mac_addr_1.octet[0],
                     wifi_context.mac_addr_1.octet[1],
                     wifi_context.mac_addr_1.octet[2],
                     wifi_context.mac_addr_1.octet[3],
                     wifi_context.mac_addr_1.octet[4],
                     wifi_context.mac_addr_1.octet[5]);
    break;
  case 7: /* <!--#softap_secu--> */
    if(softap_security == WFM_SECURITY_MODE_OPEN)                result = sprintf(pc_insert, "OPEN");
    else if(softap_security == WFM_SECURITY_MODE_WEP)            result = sprintf(pc_insert, "WEP");
    else if(softap_security == WFM_SECURITY_MODE_WPA2_WPA1_PSK)  result = sprintf(pc_insert, "WPA1/WPA2");
    else if(softap_security == WFM_SECURITY_MODE_WPA2_PSK)       result = sprintf(pc_insert, "WPA2");
    else if(softap_security == WFM_SECURITY_MODE_WPA3_SAE)       result = sprintf(pc_insert, "WPA3");
    break;
  case 8: /* <!--#softap_channel--> */
    result = sprintf(pc_insert, "%d", softap_channel);
    break;
  case 9: /* <!--#clients_list--> */
    for (uint8_t i = 0; i < DHCPS_MAX_CLIENT; i++) {
      struct eth_addr mac;
      dhcpserver_get_mac(i, &mac);
      if (!(mac.addr[0] == 0 && mac.addr[1] == 0 &&
            mac.addr[2] == 0 && mac.addr[3] == 0 &&
            mac.addr[4] == 0 && mac.addr[5] == 0)) {
    	ip_addr_t ip_addr = dhcpserver_get_ip(&mac);
        if(add_separator) strcat(string_list, ",");
        client_name[7] = i + 49;
        snprintf(string_field, 100,
                 "{\"name\":\"%s\", \"ip\":\"%d.%d.%d.%d\", \"mac\":\"%02X:%02X:%02X:%02X:%02X:%02X\"}",
                 client_name,
                 (int)(ip_addr.addr & 0xff),
                 (int)((ip_addr.addr >> 8) & 0xff),
                 (int)((ip_addr.addr >> 16) & 0xff),
                 (int)((ip_addr.addr >> 24) & 0xff),
                 mac.addr[0],
                 mac.addr[1],
                 mac.addr[2],
                 mac.addr[3],
                 mac.addr[4],
                 mac.addr[5]);
        add_separator = 1;
        strcat(string_list, string_field);
      }
    }
    result = snprintf(pc_insert, strlen(string_list) + 1, string_list);
    memset(string_list, 0, sizeof(string_list));
    break;
  case 10: /* <!--#station_state--> */
    if (wifi_context.state & SL_WFX_STA_INTERFACE_CONNECTED) {
      result = snprintf(pc_insert, 2, "1");
    } else {
      result = snprintf(pc_insert, 2, "0");
    }
    break;
  case 11: /* <!--#station_ip--> */
    result = sprintf(pc_insert, "%d.%d.%d.%d",
                     sta_netif.ip_addr.addr & 0xff,
                     (sta_netif.ip_addr.addr >> 8) & 0xff,
                     (sta_netif.ip_addr.addr >> 16) & 0xff,
                     (sta_netif.ip_addr.addr >> 24) & 0xff);
    break;
  case 12: /* <!--#station_mac--> */
    result = sprintf(pc_insert, 
                     "%02X:%02X:%02X:%02X:%02X:%02X", 
                     wifi_context.mac_addr_0.octet[0],
                     wifi_context.mac_addr_0.octet[1],
                     wifi_context.mac_addr_0.octet[2],
                     wifi_context.mac_addr_0.octet[3],
                     wifi_context.mac_addr_0.octet[4],
                     wifi_context.mac_addr_0.octet[5]);
    break;
  case 13: /* <!--#ap_ssid--> */
    result = snprintf(pc_insert, 32, "%s", wlan_ssid);
    break;
  case 14: /* <!--#ap_mac--> */
    result = sprintf(pc_insert, 
                     "%02X:%02X:%02X:%02X:%02X:%02X", 
                     ap_mac.addr[0],
                     ap_mac.addr[1],
                     ap_mac.addr[2],
                     ap_mac.addr[3],
                     ap_mac.addr[4],
                     ap_mac.addr[5]);
    break;
  case 15: /* <!--#ap_secu--> */
    if(wlan_security == WFM_SECURITY_MODE_OPEN)                result = sprintf(pc_insert, "OPEN");
    else if(wlan_security == WFM_SECURITY_MODE_WEP)            result = sprintf(pc_insert, "WEP");
    else if(wlan_security == WFM_SECURITY_MODE_WPA2_WPA1_PSK)  result = sprintf(pc_insert, "WPA1/WPA2");
    else if(wlan_security == WFM_SECURITY_MODE_WPA2_PSK)       result = sprintf(pc_insert, "WPA2");
    else if(wlan_security == WFM_SECURITY_MODE_WPA3_SAE)       result = sprintf(pc_insert, "WPA3");
    break;
  case 16: /* <!--#ap_channel--> */
    result = sprintf(pc_insert, "%d", ap_channel);
    break;
  case 17: /* <!--#event--> */
    result = sprintf(pc_insert, "%s", event_log);
    strcpy(event_log, "");
    break;
  default: result = snprintf(pc_insert, 1, "");
  }
  
  return result;
}

/***************************************************************************//**
 * Return a char from a hex
 ******************************************************************************/
static char from_hex (char ch) {
  return isdigit(ch) ? ch - '0' : tolower(ch) - 'a' + 10;
}

/***************************************************************************//**
 * Decode a string into URL format
 ******************************************************************************/
static sl_status_t url_decode(char *str) {
  char *pstr = str, rstr[64];
  int i = 0;
  
